<h1 style="color:green; font-size:30px; font-weight:700; text-align:center">
    <u><b>Sakila Dataset Analysis</b></u>  
</h1> 

<p></p> 
<strong> Author:</strong> Gurtej Bains <br> 
<strong> Data Source:</strong>   <br> 
<strong> Last Updated: </strong>  <br>  
<strong> Problem Statement:</strong> <br>

<div>
<img src="C:\Users\gurte\OneDrive\All About Learning\Coding Dojo\Learning Material\02 Weekly Assignments\wk14 02-21 (Enrichment, wk1, SQL)\Shakila dataset analysis\shakila-dataset-analysis\sakila-db-model.png" \
     alt="Drawing" 
     style="width: 1000px;"/>
</div>

<h1 style="color:green"><b>Importing Modules</b> </h1>

## Import libraries

In [2]:
# import libraries  

# Numpy
import numpy as np

# Pandas
import pandas as pd

# MatPlotLib
import matplotlib.pyplot as plt

# Seaborn
import seaborn as sns

# MissingNo
import missingno as msno

# SQL related 
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine

from pandasql import sqldf
pysqldf = lambda q: sqldf(q, globals())

# suppress warnings
import warnings
warnings.filterwarnings("ignore")

# for directory 
import os

<h1 style="color:green"><b>Connect to DB</b> </h1>

In [4]:
# Create connection string using credentials following this format
# connection = "dialect+driver://username:password@host:port/database"
username = "root"
password = "root" # (or whatever password you chose during mysql installation)
db_name = "sakila"
connection = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"

In [5]:
engine = create_engine(connection)
engine

Engine(mysql+pymysql://root:***@localhost/sakila)

<h1 style="color:green"><b>Analysis</b> </h1>

## customers inside city_id = 312

In [6]:
q = """
select last_name, first_name, email, address, city_id
from customer cust
inner join address ad
on cust.address_id = ad.address_id
and city_id = 312 
"""
pd.read_sql(q, engine)

,last_name,first_name,email,address,city_id
0,HOFFMAN,MATTIE,MATTIE.HOFFMAN@sakilacustomer.org,1497 Yuzhou Drive,312
1,VINES,CECIL,CECIL.VINES@sakilacustomer.org,548 Uruapan Street,312

## all comedy films

In [8]:
q = """
select title, description, release_year, rating, special_features
from film f 
inner join film_category fc 
    on f.film_id = fc.film_id
inner join category c
    on fc.category_id = c.category_id
where lower (c.name) = 'comedy'
"""
q2 = pd.read_sql(q, engine)
q2.head()

,title,description,release_year,rating,special_features
0,AIRPLANE SIERRA,A Touching Saga of a Hunter And a Butler who m...,2006,PG-13,"Trailers,Deleted Scenes"
1,ANTHEM LUKE,A Touching Panorama of a Waitress And a Woman ...,2006,PG-13,"Deleted Scenes,Behind the Scenes"
2,BRINGING HYSTERICAL,A Fateful Saga of a A Shark And a Technical Wr...,2006,PG,Trailers
3,CAPER MOTIONS,A Fateful Saga of a Moose And a Car who must P...,2006,G,"Trailers,Commentaries,Deleted Scenes"
4,CAT CONEHEADS,A Fast-Paced Panorama of a Girl And a A Shark ...,2006,G,"Commentaries,Deleted Scenes"

In [9]:
q2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 58 entries, 0 to 57
Data columns (total 5 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   title             58 non-null     object
 1   description       58 non-null     object
 2   release_year      58 non-null     int64
 3   rating            58 non-null     object
 4   special_features  58 non-null     object
dtypes: int64(1), object(4)
memory usage: 2.4+ KB

## films that Johnny Lollobrigida was in

In [10]:
q = """
select last_name, title, release_year 
from film a
inner join film_actor b
    on a.film_id = b.film_id 
inner join actor c
    on b.actor_id = c.actor_id 
where upper(c.first_name) = 'JOHNNY'
and upper(c.last_name) = 'LOLLOBRIGIDA'
"""
pd.read_sql(q, engine)

       last_name                 title  release_year
0   LOLLOBRIGIDA          AMADEUS HOLY          2006
1   LOLLOBRIGIDA      BANGER PINOCCHIO          2006
2   LOLLOBRIGIDA      BONNIE HOLOCAUST          2006
3   LOLLOBRIGIDA           CHITTY LOCK          2006
4   LOLLOBRIGIDA  COMMANDMENTS EXPRESS          2006
5   LOLLOBRIGIDA     CONEHEADS SMOOCHY          2006
6   LOLLOBRIGIDA      DADDY PITTSBURGH          2006
7   LOLLOBRIGIDA       DAISY MENAGERIE          2006
8   LOLLOBRIGIDA         ENOUGH RAGING          2006
9   LOLLOBRIGIDA     ESCAPE METROPOLIS          2006
10  LOLLOBRIGIDA           FIRE WOLVES          2006
11  LOLLOBRIGIDA        FRONTIER CABIN          2006
12  LOLLOBRIGIDA     GOODFELLAS SALUTE          2006
13  LOLLOBRIGIDA    GRAIL FRANKENSTEIN          2006
14  LOLLOBRIGIDA        GROOVE FICTION          2006
15  LOLLOBRIGIDA          HALL CASSIDY          2006
16  LOLLOBRIGIDA          HEAVENLY GUN          2006
17  LOLLOBRIGIDA      KRAMER CHOCOLATE          2006
18  LOLLOBRIGIDA         LOVE SUICIDES          2006
19  LOLLOBRIGIDA      METAL ARMAGEDDON          2006
20  LOLLOBRIGIDA       PACIFIC AMISTAD          2006
21  LOLLOBRIGIDA      PATTON INTERVIEW          2006
22  LOLLOBRIGIDA            POCUS PULP          2006
23  LOLLOBRIGIDA   RIDGEMONT SUBMARINE          2006
24  LOLLOBRIGIDA   RINGS HEARTBREAKERS          2006
25  LOLLOBRIGIDA         SMILE EARRING          2006
26  LOLLOBRIGIDA    SOLDIERS EVOLUTION          2006
27  LOLLOBRIGIDA        STAR OPERATION          2006
28  LOLLOBRIGIDA        SUNRISE LEAGUE          2006

## All actors in "Bingo Talented"

In [11]:
q = """
select first_name, last_name 
from film a
inner join film_actor b
    on a.film_id = b.film_id 
inner join actor c
    on b.actor_id = c.actor_id 
where upper(title) = 'BINGO TALENTED'
"""
pd.read_sql(q, engine)

  first_name    last_name
0     GOLDIE        BRODY
1    CAMERON         WRAY
2       CARY  MCCONAUGHEY
3        JON        CHASE
4      RENEE         BALL

## Customer with spend more than twice the average for all combined

In [13]:
q = """
select customer_id, amount 
from payment 
where amount > (select 2*(avg(amount)) from payment) 
order by 1,2 asc 
"""
pd.read_sql(q, engine)

     customer_id  amount
0              1    9.99
1              2   10.99
2              3    8.99
3              3    8.99
4              3    8.99
..           ...     ...
852          595    9.99
853          595   10.99
854          597    8.99
855          599    8.99
856          599    9.99

[857 rows x 2 columns]

## 5 customers with maximum number of payments

In [14]:
q = """
select first_name, last_name, count(payment_id) as num_payments 
from customer a
inner join payment b
	on a.customer_id = b.customer_id 
group by 1, 2
order by 3 desc 
limit 5
"""
pd.read_sql(q, engine)

  first_name last_name  num_payments
0    ELEANOR      HUNT            46
1       KARL      SEAL            45
2     MARCIA      DEAN            42
3      CLARA      SHAW            42
4      TAMMY   SANDERS            41